:PROPERTIES:
:ID:       423d6798-d9ba-40ee-a100-e7235ce1c1ac
:END:
#+title: ENG231 - Electrical Machines And Transformers - Assesment 2 Lab 1
#+date: [2024-08-06 Tue 12:53]
#+FILETAGS: :Assignment:UTAS:2024:
#+STARTUP: latexpreview

* ENG231 - Electrical Machines And Transformers - Assesment 2 Lab 1
- The sensor uses into the tip as positive and out as negative
- [[file:~/UTAS/ENG231 - Electrical Machines And Transformers/Lab 1/Data.ods][Data]]
- [[file:~/UTAS/ENG231 - Electrical Machines And Transformers/Lab 1/Data.m][Matlab Code]]


#+BEGIN_SRC octave :export both :results output :session Part1
close all
clear
Current=[0.1,0.15,0.2,0.25,0.3,0.35,0.4,0.45,0.5,0.6,0.7,0.8,0.9,1,1.1,1.2,1.3,1.4,1.5,1.6,1.7,1.8,1.9,2,2.1,2.2,2.3,2.4,2.5];
Field=[0.53,0.82,1.11,1.4,1.69,1.95,2.23,2.5,2.76,3.26,3.73,5,5.8,6.4,6.9,7.5,8.2,8.8,9.5,10.2,10.7,11.3,11.9,12.5,13.2,13.9,14.7,15.2,15.9];
hold on
L=0.15;
H=10.^-3.*Field./(4.*pi.*10.^-7);
N=H.*L./(Current);
fprintf("The predicted number of turns are %f, with a standard deviation of %f \n",mean(abs(N)),std(N))
plot(Current,Field)
title("Current and magnetic field plot")
xlabel('Current (A)')
ylabel('Field (mT)')
hold off
print('ENG231-Lab1-Part1.png','-dpng','-r1000');
#+END_SRC

#+RESULTS:
: The predicted number of turns are 717.129073, with a standard deviation of 48.857168


#+BEGIN_SRC octave :export both :results output :session Part2
%% Part 6
close all
clear
u0=4*pi*10^-7;
Turns = 700;
LLong=0.16;
LShort=0.3;
Current=[0.5,1,1.5,2,2.5,3,3.5,4,4.5,5];
LongFieldP=[8.4,15.7,22.7,29.6,35.9,41.2,44.6,46.8,48.5,49.7];
LongFieldN=[6.3,13.5,20.8,27.8,34.7,40,44.3,47.2,49.5,51.1];
ShortFieldP=[7.4,15,22.5,30.5,37.8,45.4,52.7,59.9,66.5,72.8];
ShortFieldN=[8,15.8,23.5,31.5,39,46.7,54.4,61.4,68.4,74.8];
FieldP=[2.9,5.8,8.7,11.8,14.7,17.7, 20.6, 23.7, 26.6, 29.4];
FieldN=[3.3,6.4,9.5,12.9,15.7,18.8,21.9,25.2,28.2,31.3];

%Using only the linear part of the data (-3 -> 3)
% Calculate H for long and short objects
% Long object
HLong  = Turns.*Current / LLong; % H for long object
urLongP=LongFieldP(1:2*3)*10^-3./(u0*HLong(1:2*3));
urLongN=LongFieldN(1:2*3)*10^-3./(u0*HLong(1:2*3));
urLong=[urLongP,urLongN];
fprintf("The predicted value for relative magnetic permeability is for the long object is %f, with standard deviation of %f \n",mean(urLong),std(urLong))
figure(1)
hold on
plot(LongFieldP,HLong,-LongFieldN,-HLong);
title("Magnetic field density and magnetic field intensity of the long object")
xlabel('Magnetic flux intensity (A/m)')
ylabel('Magnetic flux density (T)')
print('ENG231-Lab1-Part2-long.png','-dpng','-r1000');
hold off

% Short object
HShort= Turns*Current / LShort;
urShortP=ShortFieldP*10^-3./(u0*HShort);
urShortN=ShortFieldN*10^-3./(u0*HShort);
mean(urShortP);
mean(urShortN);
urShort=[urShortP,urShortN];
fprintf("The predicted value for relative magnetic permeability is for the short object is %f, with standard deviation of %f \n",mean(urShort),std(urShort))
figure(2)
hold on
plot(HShort,ShortFieldP,-HShort,-ShortFieldN);
title("Magnetic field density and magnetic field intensity of the short object")
xlabel('Magnetic flux intensity (A/m)')
ylabel('Magnetic flux density (T)')
print('ENG231-Lab1-Part2-short.png','-dpng','-r1000');
hold off
#+END_SRC

#+RESULTS:
: The predicted value for relative magnetic permeability is for the long object is 2.601148, with standard deviation of 0.208601
: The predicted value for relative magnetic permeability is for the short object is 5.202822, with standard deviation of 0.132389
